Repository: kurisu994/host-cat
Catalog: Sources/HostCatCore/Resources/LocalizableCore.xcstrings
Source language: zh_hans
Languages: en

# default.node_name
source: 默认
en: Default

# error.parser.invalid_ip
source: 第 %d 行 IP 地址无效: %@
en: Line %d: Invalid IP address: %@

# error.parser.missing_hostname
source: 第 %d 行缺少 hostname
en: Line %d: Missing hostname

# error.parser.invalid_hostname
source: 第 %d 行 hostname 无效: %@
en: Line %d: Invalid hostname: %@

# error.parser.empty_content
source: 内容为空
en: Content is empty

# write.error.file_immutable
source: hosts 文件当前被锁定保护(immutable flags), HostCat 不会自动移除保护标志。
en: The hosts file is currently locked (immutable flags). HostCat will not automatically remove protection flags.

# write.error.hash_mismatch
source: hosts 文件已在 HostCat 之外被修改。
en: The hosts file has been modified outside of HostCat.

# write.error.content_validation_failed
source: 写入内容校验失败: %@
en: Content validation failed: %@

# write.error.temp_file_creation_failed
source: 创建临时文件失败: %@
en: Failed to create temporary file: %@

# write.error.write_failed
source: 写入失败: %@
en: Write failed: %@

# write.error.rename_failed
source: 原子替换失败: %@
en: Atomic replacement failed: %@

# write.error.permission_set_failed
source: 权限设置失败: %@
en: Permission setting failed: %@

# write.error.dns_refresh_failed
source: DNS 缓存刷新失败: %@
en: DNS cache refresh failed: %@

# backup.error.directory_creation_failed
source: 备份目录创建失败。
en: Failed to create backup directory.

# backup.error.write_failed
source: 备份文件写入失败。
en: Failed to write backup file.

# backup.error.cleanup_failed
source: 旧备份清理失败。
en: Failed to clean up old backups.

# config.error.unsupported_version
source: 配置文件版本 %d 暂不支持。
en: Config version %d is not supported.

# config.error.atomic_replace_failed
source: 配置文件原子替换失败, 系统错误码: %d。
en: Config file atomic replacement failed, system error code: %d.

# config.error.invalid_json
source: 配置文件已损坏, 已恢复为默认设置。
en: Config file is corrupted, restored to default settings.

# recovery.invalid_json
source: 配置文件已损坏, 已恢复为默认设置。
en: Config file is corrupted, restored to default settings.

# recovery.unsupported_version
source: 配置文件版本 %d 暂不支持, 已恢复为默认设置。
en: Config version %d is not supported, restored to default settings.

# log.merge_success
source: 合并成功: %d 条记录, %d 条重复。
en: Merge successful: %d records, %d duplicates.

# log.merge_conflicts
source: 合并冲突: %d 个冲突。
en: Merge conflicts: %d conflicts.

# log.merge_failed
source: 合并失败: %@
en: Merge failed: %@

# log.write_success
source: 写入成功, hash: %@...
en: Write successful, hash: %@...

# log.write_failed
source: 写入失败: %@
en: Write failed: %@

# log.backup_created
source: 备份创建成功: %@
en: Backup created: %@

# log.backup_failed
source: 备份失败: %@
en: Backup failed: %@

# log.backup_cleaned
source: 清理旧备份: %@
en: Cleaned old backup: %@

# log.backup_clean_failed
source: 删除旧备份失败 %@
en: Failed to delete old backup %@

# helper.not_installed
source: 助手未安装。
en: Helper is not installed.

# helper.connection_failed
source: 连接助手失败。
en: Failed to connect to helper.

# helper.registration_failed
source: 助手注册失败。
en: Helper registration failed.

# helper.authentication_failed
source: 助手认证失败。
en: Helper authentication failed.

# helper.unavailable
source: Privileged Helper 暂时不可用: %@
en: Privileged Helper is temporarily unavailable: %@

# helper.not_registered
source: Privileged Helper 尚未注册，请在设置中注册。
en: Privileged Helper is not registered. Register it in Settings.

# helper.requires_approval
source: Privileged Helper 需要在「系统设置 > 登录项」中审批。
en: Privileged Helper needs approval in System Settings > Login Items.

# helper.connection_interrupted
source: 与 Helper 的连接已中断，请重试。
en: Connection to Helper was interrupted. Try again.

# helper.connection_invalidated
source: 与 Helper 的连接已失效，请检查 Helper 状态。
en: Connection to Helper is no longer valid. Check Helper status.

# helper.request_timed_out
source: 与 Helper 通信超时，请重试。
en: Communication with Helper timed out. Try again.

# helper.unexpected_reply
source: Helper 返回了无法识别的响应: %@
en: Helper returned an unexpected response: %@

# helper.proxy_unavailable
source: 无法获取 XPC 代理。
en: Unable to obtain an XPC proxy.

# helper.reply_missing_success
source: 响应缺少成功状态。
en: Response is missing the success status.

# helper.reply_missing_final_hash
source: 成功响应缺少最终 hosts hash。
en: Successful response is missing the final hosts hash.

# menubar.config_save_failed
source: 配置保存失败
en: Failed to save configuration

# menubar.external_modification
source: hosts 文件已在 HostCat 之外被修改
en: The hosts file has been modified outside of HostCat

# menubar.conflicts_detected
source: 检测到 %d 个冲突，请解决后再应用
en: Detected %d conflicts, please resolve before applying

# menubar.hosts_not_applied
source: hosts 未应用: %@
en: Hosts not applied: %@

# log.config_persist_success
source: 应用配置持久化成功
en: Configuration persisted successfully

# log.config_persist_failed
source: 应用配置持久化失败: %@
en: Configuration persist failed: %@

# log.draft_persist_success
source: 配置草稿持久化成功
en: Draft configuration persisted successfully

# log.draft_persist_failed
source: 配置草稿持久化失败: %@
en: Draft configuration persist failed: %@

# log.merge_preview
source: 合并预览更新: %d 条记录, %d 条重复
en: Merge preview updated: %d records, %d duplicates

# log.preview_conflicts
source: 预览冲突: %d 个
en: Preview conflicts: %d conflicts

# log.preview_merge_failed
source: 预览合并失败: %@
en: Preview merge failed: %@

# log.external_modification
source: 检测到外部修改
en: External modification detected

# log.apply_failed
source: %@, hosts 未应用: %@
en: %@, hosts not applied: %@

# helper.status.not_registered
source: 未注册
en: Not Registered

# helper.status.enabled
source: 已启用
en: Enabled

# helper.status.requires_approval
source: 需要审批
en: Requires Approval

# helper.status.not_found
source: 未找到
en: Not Found

# helper.register_failed
source: Helper 注册失败: %@
en: Helper registration failed: %@

# helper.launch_at_login_failed
source: 开机自启动设置失败: %@
en: Launch at login setting failed: %@

# error.unknown
source: 未知错误
en: Unknown error
